[
{"text": "50,000-mile offer$5,000 spend requiredEarn 20,000 award miles after your first purchase and payment of the annual fee, then an additional 30,000 award miles after you make $5,000 in purchases within the first 90 days.$89 annual fee, not waivedno foreign transaction feesannual companion ticket2 Lufthansa Business Lounge vouchers annuallyhttps://www.barclaycardus.com/apply/...7&amp;cellNumber=535,000-mile offer$1,000 spend requiredhttp://www.miles-and-more.com/online...en&amp;cid=1000390", "postDate": "Search Forums", "author": "Click here to display Full Wiki"},
{"text": "Barclays (USA) Lufthansa MasterCard - Revived - 50K after $5K spend", "postDate": "May 2, 13, 5:38 pm", "author": "cerealmarketer"},
{"text": "Ah Barclay Bank..........I JUST went for the US Airways CC with them this past weekend before the US Airway merge with AA. Hmm hope the offer is around for a while.", "postDate": "May 2, 13, 6:23 pm", "author": "World-Wide"},
{"text": "There's another offer for this card out there, with a lower spending requirement ($2500 in 3 months):https://www.barclaycardus.com/app/ja...13&amp;legacy=trueHowever, that one (unlike the new one) looks like it does have the lower signup bonus for the Platinum card, if you're approved for that one.", "postDate": "May 2, 13, 6:55 pm", "author": "habsben"},
{"text": "Got the US Air MC on Feb 14 (my first Barclay's card), just got approved for this through link on post #1 -- thanks cerealmarketer.", "postDate": "May 2, 13, 7:00 pm", "author": "Deioces"},
{"text": "First LH 50k offer I have ever seen in last two years.  Looks like Barclays is being a little more agressive since the the US-AA merger announcement.  Does LH Miles &amp; Mores  still have a short short shelf life........36 months?", "postDate": "May 2, 13, 8:01 pm", "author": "jethro"},
{"text": "Like most American travelers, I know next to nothing about the Lufthansa frequent flyer program.  Is there anything \"interesting\" that can be done with 50,000 miles?  Otherwise, I think I'll save my Barclay's apps for their pretty lucrative cash rebates (like with the NFL card and that new product) and, of course, the annual churn of the US Airways card (before it goes away).", "postDate": "May 2, 13, 8:11 pm", "author": "iahphx"},
{"text": "Quote:Originally Posted by iahphxLike most American travelers, I know next to nothing about the Lufthansa frequent flyer program.  Is there anything \"interesting\" that can be done with 50,000 miles?  Otherwise, I think I'll save my Barclay's apps for their pretty lucrative cash rebates (like with the NFL card and that new product) and, of course, the annual churn of the US Airways card (before it goes away).Ya I don't know about Lufthansa frequent flyer program, and how it works. Would love to hear from those who know how valuable this 50K offer actually is?", "postDate": "May 2, 13, 8:19 pm", "author": "World-Wide"},
{"text": "Quote:Originally Posted by iahphxLike most American travelers, I know next to nothing about the Lufthansa frequent flyer program.  Is there anything \"interesting\" that can be done with 50,000 miles?  Otherwise, I think I'll save my Barclay's apps for their pretty lucrative cash rebates (like with the NFL card and that new product) and, of course, the annual churn of the US Airways card (before it goes away).At minimum 50k gets a domestic first class on United. But what I am trying to figure out is if their award map calculator is right and it's only 35k for domestic first on United which is a great deal.I would normally not redeem my United miles for domestic first...but if it's part of an orphan bonus offer from a non-core bank, then it's a good option for me.", "postDate": "May 2, 13, 8:32 pm", "author": "cerealmarketer"},
{"text": "Quote:Originally Posted by iahphxLike most American travelers, I know next to nothing about the Lufthansa frequent flyer program.  Is there anything \"interesting\" that can be done with 50,000 miles?  Otherwise, I think I'll save my Barclay's apps for their pretty lucrative cash rebates (like with the NFL card and that new product) and, of course, the annual churn of the US Airways card (before it goes away).If Barclays throws the bloggers a bone I would say you will get more than enought info on LH.  I personally hope they do  ", "postDate": "May 2, 13, 8:38 pm", "author": "jethro"},
{"text": "Quote:Originally Posted by cerealmarketerIs domestic first class within the U.S. really only 35,000 miles? Tried Lufthansa's mileage calculator / map linked from the page above and it seems to say that for all the 2 cabin first class routes in the U.S (seems they charge it at the business class rate).I would cautiously tend to believe their published award chart over the calculator.  Domestic J shows there as being 55,000 miles:http://www.miles-and-more.com/mediap..._785183620.pdf", "postDate": "May 2, 13, 8:43 pm", "author": "saacman5033"},
{"text": "Quote:Originally Posted by cerealmarketerAt minimum 50k gets a domestic first class on United. But what I am trying to figure out is if their award map calculator is right and it's only 35k for domestic first on United which is a great deal.I would normally not redeem my United miles for domestic first...but if it's part of an orphan bonus offer from a non-core bank, then it's a good option for me.Got to be better use though then travel in the US. Wait are there fuel charges on Lufthansa?", "postDate": "May 2, 13, 8:49 pm", "author": "World-Wide"},
{"text": "Quote:Originally Posted by saacman5033I would cautiously tend to believe their published award chart over the calculator.  Domestic J shows there as being 55,000 miles:http://www.miles-and-more.com/mediap..._785183620.pdfAnd that is the mystery. 'Domestic' is one country (bottom of that chart). So theoretically like the Europe/Europe is for say Germany -- France the North America/North America is for say US--Canada. Wish someone has redeemed these here...but I guess the intro bonus is essentially 55k with the spend so a J ticket either way.", "postDate": "May 2, 13, 9:11 pm", "author": "cerealmarketer"},
{"text": "I did a bit of an analysis what you can do with Miles&amp;More miles a while ago - this may be relevant.- You can book one-way awards or round-trip.- You can book LH group tickets online - you will need to call for partners.-  US domestic awards are the same price as United Mileage Plus, that's 25,000 miles in Y and $2.50 per segment- US to Hawaii in Y is 40,000 miles and minimal taxes/fees- Domestic First Class (books as business class for LH) is 35,000 miles and minimal taxes/fees- US residents pay just 50k miles for a Round-Trip to Europe in Economy. If you manage to find seats on US Airways or LOT there are no fuel surcharges! Otherwise it's $300++. - the Middle East/ Northern Africa zone is pretty huge at Miles &amp;amp; More (interestingly Turkey is not in the region but in Europe!), now that Ethiopian Airlines has joined you can fly from West Africa all the way into Dubai in a one region award  - take a good look at the 3 region awards, they apply for any flights crossing the Atlantic but not the Pacific, for example HKG-FRA-SFO would be considered a 3 region award at Miles &amp;amp; More. Why is this good value? Well find the longest 4 segment one-way and a place where there are no fuel surcharges (Brazil!) and route from Brazil to Europe to Australia - Miles &amp;amp; More has excellent availability for Lufthansa's A380 in First Class 330 days out. Often 2 seats are released at once with more to follow. Availability is the same as it used to be for partners several years ago. - I confirmed all mileage requirements with the LH call center. Also availability seemed the same as on united.com.- you can book LH group redemptions online and for partners you will need to call, agents are generally pretty knowledgeablehttp://www.mightytravels.com/1323275...5000_spend.php", "postDate": "May 2, 13, 9:12 pm", "author": "MightyTravels"},
{"text": "Quote:Originally Posted by cerealmarketerAnd that is the mystery. 'Domestic' is one country (bottom of that chart). So theoretically like the Europe/Europe is for say Germany -- France the North America/North America is for say US--Canada. Wish someone has redeemed these here...but I guess the intro bonus is essentially 55k with the spend so a J ticket either way.Good point.  I completely missed that block at the bottom.", "postDate": "May 2, 13, 10:08 pm", "author": "saacman5033"},
{"text": "Quote:Originally Posted by cerealmarketerAnd that is the mystery. 'Domestic' is one country (bottom of that chart). So theoretically like the Europe/Europe is for say Germany -- France the North America/North America is for say US--Canada. Wish someone has redeemed these here...but I guess the intro bonus is essentially 55k with the spend so a J ticket either way.US Domestic First Class is 17,000 miles one-way and 35,000 RT. Just spoke to M&amp;M Call Center in Singapore. My test was JFK-LAX in UA F (booked as Business Class).", "postDate": "May 2, 13, 10:16 pm", "author": "MightyTravels"}
]